project/app/Models/Admin/NoticiaModel.php

	public function get($id = null)
	{
		if($id <> null)
		{
			return $this->find($id);
---
SELECT *
FROM `noticias`
WHERE `noticias`.`deleted_at` IS NULL
AND `noticias`.`id` = '21'