project/app/Controllers/Site/Home.php

SELECT `noticias`.`id` as `id`, `noticias`.`titulo` as `tituloNoticia`, `noticias`.`texto` as `texto`, `noticias_categorias`.`titulo` as `tituloCategoria`, `noticias`.`capa` as `capa`, `noticias`.`dataNoticia` as `dataNoticia`, `noticias`.`slug` as `slug`, `noticias`.`visualizacoes` as `visualizacoes`
FROM `noticias`
JOIN `noticias_categorias` ON `noticias`.`idCategoria` = `noticias_categorias`.`id`
WHERE `status` = 1
AND `noticias`.`deleted_at` IS NULL
ORDER BY `noticias`.`dataNoticia` desc
 LIMIT 3
---
    public function index()
    {
        helper('text');
        setlocale(LC_TIME, 'pt_BR.utf-8');


        $this->data = 	[
                            'noticia'   => $this->modelNoticia->select('noticias.id as id, noticias.titulo as tituloNoticia, noticias.texto as texto, noticias_categorias.titulo as tituloCategoria,
                                                                        noticias.capa as capa, noticias.dataNoticia as dataNoticia, noticias.slug as slug, noticias.visualizacoes as visualizacoes')
                                ->join('noticias_categorias', 'noticias.idCategoria = noticias_categorias.id')
                                ->where('status', 1)
                                ->limit(3)
                                ->orderBy('noticias.dataNoticia desc')
                                ->find(),
                            'banner'    => $this->modelBanner->where('status', '1')->orderBy('posicao', 'asc')->findAll()
                        ];